# Filtering, Ordering, and Limiting Data with SQL - Lab

## Introduction
In this lab, you will practice writing SQL `SELECT` queries that limit results based on conditions, using `WHERE`, `ORDER BY`, and `LIMIT`.

## Objectives
You will practice the following:

* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
* Limit the number of records returned by a query using `LIMIT`
* Write SQL queries to filter and order results

## The Data

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

In the cell below, import `pandas` and `sqlite3`. Then establish a connection to the database `dogs.db`.

Look at all of the data in the table by selecting all columns from the `dogs` table with `pd.read_sql`.

In [ ]:
import pandas as pd
import sqlite3

con = sqlite3.connect("dogs.db")

In [2]:
all_dogs = """ 
            SELECT * 
            FROM dogs
           """
pd.read_sql(all_dogs,con)

   id        name  age gender             breed  temperament  hungry
0   1      Snoopy    3      M            beagle     friendly       1
1   2     McGruff   10      M        bloodhound        aware       0
2   3      Scooby    6      M        great dane       hungry       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   5     Pickles   13      F         black lab  mischievous       1
5   6    Clifford    4      M           big red       smiley       1
6   7      Lassie    7      F            collie       loving       1
7   8       Snowy    8      F       fox terrier  adventurous       0
8   9        None    4      M  golden retriever      playful       1

In [6]:
all1 = """ 
            SELECT *
            FROM sqlite_master
           """
pd.read_sql(all1,con)

,type,name,tbl_name,rootpage,sql
0,table,dogs,dogs,2,"CREATE TABLE dogs (id INTEGER PRIMARY KEY,\n ..."

In [17]:
#PRAGMA database_list


all2 = """ 
            PRAGMA table_info(dogs)
       """
pd.read_sql(all2,con)[["name","type"]]

          name     type
0           id  INTEGER
1         name     TEXT
2          age  INTEGER
3       gender  CHAR(1)
4        breed     TEXT
5  temperament     TEXT
6       hungry  BOOLEAN

## Queries

Display the outputs for each of the following query descriptions.

### Select the name and breed for all female dogs

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>WHERE</code> with the <code>=</code> operator</p>
</details>

In [23]:
all_female = """ 
              SELECT *
              FROM dogs
              WHERE gender = "F"
             """
pd.read_sql_query(all_female,con)

   id        name  age gender        breed  temperament  hungry
0   4  Little Ann    5      F    coonhound        loyal       0
1   5     Pickles   13      F    black lab  mischievous       1
2   7      Lassie    7      F       collie       loving       1
3   8       Snowy    8      F  fox terrier  adventurous       0

### Select the number of dogs that do not have a name

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>COUNT</code> and <code>IS NULL</code></p>
</details>

In [ ]:
no_name = """ 
              SELECT COUNT(*) AS "Dogs with no Name"
              FROM dogs
              WHERE name IS NULL
             """
pd.read_sql_query(no_name,con)

   Dogs with no Name
0                  1

### Select the names of all dogs that contain the double letters `ff` or `oo`

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>LIKE</code>, <code>%</code>, and <code>OR</code></p>
</details>

In [49]:
dogs_with_ff_or_oo = """ 
              SELECT *
              FROM dogs
              WHERE LOWER(name) LIKE "%ff%" 
              OR LOWER(name) LIKE "%oo%" 
             """
pd.read_sql_query(dogs_with_ff_or_oo,con)

   id      name  age gender       breed temperament  hungry
0   1    Snoopy    3      M      beagle    friendly       1
1   2   McGruff   10      M  bloodhound       aware       0
2   3    Scooby    6      M  great dane      hungry       1
3   6  Clifford    4      M     big red      smiley       1

### Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>ORDER BY</code></p>
</details>

In [54]:
ascending_order = """ 
              SELECT *
              FROM dogs
              ORDER BY name ASC
             """
pd.read_sql_query(ascending_order,con)

   id        name  age gender             breed  temperament  hungry
0   9        None    4      M  golden retriever      playful       1
1   6    Clifford    4      M           big red       smiley       1
2   7      Lassie    7      F            collie       loving       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   2     McGruff   10      M        bloodhound        aware       0
5   5     Pickles   13      F         black lab  mischievous       1
6   3      Scooby    6      M        great dane       hungry       1
7   1      Snoopy    3      M            beagle     friendly       1
8   8       Snowy    8      F       fox terrier  adventurous       0

### Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [58]:
hungry_dogs = """ 
              SELECT name as "Dog's Name" , breed as "Breed of the Dog"
              FROM dogs
              WHERE hungry = "1"
              ORDER BY age ASC
             """
pd.read_sql_query(hungry_dogs,con)

  Dog's Name  Breed of the Dog
0     Snoopy            beagle
1   Clifford           big red
2       None  golden retriever
3     Scooby        great dane
4     Lassie            collie
5    Pickles         black lab

### Select the oldest dog's name, age, and temperament

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>ORDER BY</code> with <code>LIMIT</code></p>
</details>

In [63]:
oldest_dog = """ 
              SELECT name as "Dog's Name" , age as "Dog's Age", temperament
              FROM dogs
              ORDER BY age DESC
              LIMIT 1
             """
pd.read_sql_query(oldest_dog,con)

  Dog's Name  Dog's Age  temperament
0    Pickles         13  mischievous

### Select the name and age of the three youngest dogs

In [64]:
yougest_dog = """ 
              SELECT name as "Dog's Name" , age as "Dog's Age"
              FROM dogs
              ORDER BY age ASC
              LIMIT 3
             """
pd.read_sql_query(yougest_dog,con)

  Dog's Name  Dog's Age
0     Snoopy          3
1   Clifford          4
2       None          4

### Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>WHERE</code> with <code>BETWEEN</code></p>
</details>

In [68]:
breed_of_dogs = """ 
              SELECT name as "Dog's Name" , breed as "Breed of the Dog"
              FROM dogs
              WHERE age BETWEEN "5" AND "10"
              ORDER BY age DESC
             """
pd.read_sql_query(breed_of_dogs,con)

   Dog's Name Breed of the Dog
0     McGruff       bloodhound
1       Snowy      fox terrier
2      Lassie           collie
3      Scooby       great dane
4  Little Ann        coonhound

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [71]:
breed_of_dogs = """ 
              SELECT name as "Dog's Name" , Age as "Dog's Age",hungry as "Dog's Hunger"
              FROM dogs
              WHERE hungry = "1" AND age BETWEEN "2" AND "7"
              ORDER BY name ASC
             """
pd.read_sql_query(breed_of_dogs,con)

  Dog's Name  Dog's Age  Dog's Hunger
0       None          4             1
1   Clifford          4             1
2     Lassie          7             1
3     Scooby          6             1
4     Snoopy          3             1

## Close the Database Connection

In [72]:
con.close()

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity and order of your results.